Revit 2024 API
View.SetNonControlledTemplateParameterIds Method
 Sets the parameters that will not be included when this view is used as a template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetNonControlledTemplateParameterIds(
	ICollection<ElementId> newSet
)
Visual Basic
Public Sub SetNonControlledTemplateParameterIds ( _
	newSet As ICollection(Of ElementId) _
)
Visual C++
public:
void SetNonControlledTemplateParameterIds(
	ICollection<ElementId^>^ newSet
)
Parameters
newSet
Type: System.Collections.Generic.ICollection<ElementId>
 The parameter ids that should not be marked to be included.
Remarks
 This should be a subset of the parameters returned by GetTemplateParameterIds() (other parameters will be ignored).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace